org/posts.org
#+title: Posts
#+author: JD
#+startup: overview
#+hugo_base_dir: ../
#+hugo_front_matter_format: yaml
#+hugo_custom_front_matter: :showToc true
#+hugo_custom_front_matter: :TocOpen false
#+hugo_custom_front_matter: :hidemeta: false
#+hugo_custom_front_matter: :comments: false
#+hugo_custom_front_matter: :canonicalURL: "https://canonical.url/to/page"
#+hugo_custom_front_matter: :disableShare: false
#+hugo_custom_front_matter: :hideSummary: false
#+hugo_custom_front_matter: :searchHidden: true
#+hugo_custom_front_matter: :ShowReadingTime: true
#+hugo_custom_front_matter: :ShowBreadCrumbs: true
#+hugo_custom_front_matter: :ShowPostNavLinks: true

* TODO Just Extract It!
 :PROPERTIES:
 :EXPORT_HUGO_BUNDLE: extract-it
 :EXPORT_FILE_NAME: index
 :EXPORT_DATE: 2024-11-19
 :EXPORT_HUGO_CUSTOM_FRONT_MATTER: :description ""
 :EXPORT_HUGO_CUSTOM_FRONT_MATTER+: :ShowToc false
 :EXPORT_HUGO_CUSTOM_FRONT_MATTER+: :TocOpen false
 :END:

** Intro
Writing good well-designed code is a task that's much easier said than done. There's a litany of patterns, books, blogs, and talks on the subject of how to design your code so it's extensible and readable and [[https://world.hey.com/dhh/beautiful-motivations-6fef7c73][aesthetic]]. One thing that is frequently overlooked (with the exception of Sandi Metz talks...) is arguably the most important step in the process, the actual journey it takes to arrive. Usually, the content takes one of two approaches when discussing this:

1. "Here's a pattern and here's a use case."
2. A "todo list" of ways to improve your code

Both of these types of content certainly have value and play their role well, however, /determining the heuristic/ around applying these techniques is the most difficult part. It could be something that's learned only by experience, but in this post I'm hoping to supply at least one or two helpful heuristics

#+begin_quote
/*Heuristic*/ - involving or serving as an aid to learning, discovery, or problem-solving by experimental and especially trial-and-error methods
#+end_quote

