content/posts/extract-it/index.md
---
title: "Just Extract It!"
author: ["JD"]
date: 2024-11-19
draft: true
ShowToc: false
TocOpen: false
---

## Intro {#intro}

Writing good well-designed code is a task that's much easier said than done. There's a litany of patterns, books, blogs, and talks on the subject of how to design your code so it's extensible and readable and [aesthetic](https://world.hey.com/dhh/beautiful-motivations-6fef7c73). One thing that is frequently overlooked (with the exception of Sandi Metz talks...) is arguably the most important step in the process, the actual journey it takes to arrive. Usually, the content takes one of two approaches when discussing this:

1.  "Here's a pattern and here's a use case."
2.  A "todo list" of ways to improve your code

Both of these types of content certainly have value and play their role well, however, _determining the heuristic_ around applying these techniques is the most difficult part. It could be something that's learned only by experience, but in this post I'm hoping to supply at least one or two helpful heuristics

> _**Heuristic**_ - involving or serving as an aid to learning, discovery, or problem-solving by experimental and especially trial-and-error methods
